app/controllers/blog_controller.rb

  def index
    @post = Post.where("published_date <= ?", Time.zone.now).order("published_date desc").first
---
SELECT "posts".* FROM "posts" WHERE (published_date <= '2024-08-23 17:14:31.959498') ORDER BY published_date desc LIMIT ?  [["LIMIT", 1]]